app/views/survey/instructions.html.erb

INSERT INTO "responses" ("respondent_id", "created_at", "updated_at", "RecentVacation", "International", "Country", "State", "City", "TripReason", "TripLength", "Enjoyment", "TripCost", "SP1", "SP2", "SP3", "SP4", "RespondentID", "Gender", "Age", "Education", "HeadOfHousehold", "Income", "Kids", "Adolescents", "Adults", "Workers", "Zipcode", "HomeType", "Occupation", "Commute", "License", "BuyAnotherVehicle", "BuyNewUsed", "PurchaseTime", "CarsPerHH", "MakeModelPrimary", "BuyReason1", "MakeModelSecond", "BuyReason2", "MakeModelThird", "BuyReason3", "HomeParking", "DriveToWork", "ParkingCost", "VehicleYear", "VehicleMiles", "VehicleHybrid", "VehicleNew", "PurchaseYear", "VehiclePrice", "VehicleMPG") VALUES (8, '2013-01-18 00:57:51.680528', '2013-01-18 00:57:51.680528', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
				<br>
				If you feel like you would like to go back to the previous question and change your response,
				<b>do not use your browser's back button</b>. Press the <%= submit_tag "  <<  BACK   " %> button