app/controllers/survey_controller.rb

UPDATE "variables" SET "variable_hash" = '--- {}
---
        |question|
        @variable.variable_hash[question.question_name.to_sym] = '' if question.question_object.responses?
      end
      @variable.save