app/controllers/survey_controller.rb

INSERT INTO "respondents" ("created_at", "updated_at") VALUES ('2013-01-13 02:14:07.247000', '2013-01-13 02:14:07.247000')
INSERT INTO "responses" ("respondent_id", "created_at", "updated_at", "RecentVacation", "International", "Country", "State", "City", "TripReason", "TripLength", "Enjoyment", "TripCost", "SP1", "SP2", "SP3", "SP4", "RespondentID", "Gender", "Age", "Education", "HeadOfHousehold", "Income", "Kids", "Adolescents", "Adults", "Workers", "Zipcode", "HomeType", "Occupation", "Commute", "License", "BuyAnotherVehicle", "BuyNewUsed", "PurchaseTime", "CarsPerHH", "MakeModelPrimary", "BuyReason1", "MakeModelSecond", "BuyReason2", "MakeModelThird", "BuyReason3", "HomeParking", "DriveToWork", "ParkingCost", "VehicleYear", "VehicleMiles", "VehicleHybrid", "VehicleNew", "PurchaseYear", "VehiclePrice", "VehicleMPG") VALUES (8, '2013-01-18 00:57:51.680528', '2013-01-18 00:57:51.680528', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
INSERT INTO "variables" ("created_at", "updated_at", "respondent_id", "variable_hash") VALUES ('2013-01-13 02:14:07.400000', '2013-01-13 02:14:07.400000', 1, '--- {}
---
  def instructions
    @name = "Survey Instructions"
    @description = ""

    #Initialize the Respondent, add entry to database
    if session[:count] == nil
      @respondent = Respondent.new
      @variable = Variable.new
      @variable.variable_hash = {}
      @respondent.variable = @variable
      @response = Response.new
      @respondent.response = @response

      @respondent.save

SELECT "pages".* FROM "pages" WHERE "pages"."sequence_id" = 1 LIMIT 1
SELECT "respondents".* FROM "respondents" WHERE "respondents"."id" = 1 LIMIT 1
SELECT "responses".* FROM "responses" WHERE ("responses".respondent_id = 1) LIMIT 1
---
  def question
    load 'questions/question.rb'

    @page = Page.find_by_sequence_id(session[:count])
    @questionObject = @page.questions[0].question_object

    @respondent = Respondent.find_by_id(session[:ID])
    @variable = @respondent.variable
    @variable_hash = @variable.variable_hash
    puts "Variable_hash: #{@variable_hash}"

    if @questionObject.survey_settings?
      session[:survey_name] = @questionObject.survey_name if @questionObject.survey_name
      session[:survey_description] = @questionObject.description if @questionObject.description
      session[:section] = @questionObject.section if @questionObject.section

      return redirect_to :action => "check", :submit_count => session[:count]
    end

    @survey = Respondent.find_by_id(session[:ID]).response

SELECT "questions".* FROM "questions" WHERE "questions"."question_name" = 'International' LIMIT 1
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 5 LIMIT 1
---

      if @questionObject.class == RubyJulie::MultipleChoiceLink
        begin
          next_page_id = Question.find_by_question_name(@questionObject.nextQuestion(@survey.send(@questionObject.base_question_name))).page_id
        rescue NoMethodError => e
          raise NoMethodError, "In a MultipleBranch, the question name given for a possible branch, #{@questionObject.nextQuestion(@survey.send(@questionObject.base_question_name))}, does not exist in the survey.\n\nOriginal Exception Throw: " + e.to_s, e.backtrace
        end
        session[:count] = Page.find_by_id(next_page_id).sequence_id

UPDATE "variables" SET "variable_hash" = '---
---
        Tam::run_interpreter(next_question.before_calculations, @variable_hash) if next_question.before_calculations && next_question.before_calculations != ""

        @variable.variable_hash = @variable_hash
        @variable.save

SELECT "pages".* FROM "pages" LIMIT 1
SELECT "questions".* FROM "questions" WHERE ("questions".page_id = 1)
---

    if @count == 1 && @count_actual == 1
      @back = false
    elsif @count == 1 && (Page.first.questions[0].question_object.calculation? || Page.first.questions[0].question_object.survey_settings?)

SELECT "respondents".* FROM "respondents" WHERE "respondents"."id" = 1 LIMIT 1
SELECT "responses".* FROM "responses" WHERE ("responses".respondent_id = 1) LIMIT 1
SELECT "pages".* FROM "pages" WHERE "pages"."sequence_id" = 17 LIMIT 1
SELECT "experiments".* FROM "experiments" WHERE "experiments"."name" = 'VacationChoice' LIMIT 1
---
  def scenario
    load 'questions/question.rb'
    load 'questions/choice_experiment.rb'

    if session[:count] == nil
      redirect_to :action => "survey"
    end

    @survey = Respondent.find_by_id(session[:ID]).response

    @page = Page.find_by_sequence_id(session[:count])
    return redirect_to :action => "results" unless @page   #If page isn't found, because sequence ID doesn't match, then the survey must have been completed

    @question = @page.questions[0].question_object

    @respondent = Respondent.find_by_id(session[:ID])
    @variable = @respondent.variable
    @variable_hash = @variable.variable_hash

    @name = session[:survey_name]
    @description = session[:survey_description]

    @count = session[:ques_count]
    @count_actual = session[:count]

    # Redirects to the default survey page if the current question isn't a scenario
    if @question.scenario? != true
      return redirect_to :action => "survey"
    end

    @experiment = Experiment.find_by_name(@question.choice_experiment_name).choice_exp_object

SELECT "respondents".* FROM "respondents" WHERE "respondents"."id" = 1 LIMIT 1
SELECT "responses".* FROM "responses" WHERE ("responses".respondent_id = 1) LIMIT 1
SELECT "pages".* FROM "pages" WHERE "pages"."sequence_id" = 1 LIMIT 1
---
  def check
    load 'questions/question.rb'

    if session[:answer] == nil
      session[:answer] = Array.new
    end

    @survey = Respondent.find_by_id(session[:ID]).response

    @page = Page.find_by_sequence_id(session[:count])

UPDATE "responses" SET "TripReason" = 'The Olympics were in town and I''ve never been to the Olympics before.', "updated_at" = '2013-01-13 02:15:46.824000' WHERE "responses"."id" = 1
---
          response = params[:answer]
        end

        Response.update(session[:ID], { @question.name => response})

UPDATE "variables" SET "variable_hash" = '--- {}
---
    if Page.find_by_sequence_id(session[:count]) == nil
      #Update the variable hash
      @variable.variable_hash = @variable_hash
      @variable.save

SELECT "pages".* FROM "pages" WHERE "pages"."sequence_id" IS NULL LIMIT 1
---
  def back
    load 'questions/question.rb'

    if session[:sequence].size > 0
      session[:count] = session[:sequence].pop

      question = Page.find_by_sequence_id(session[:count]).questions[0].question_object

SELECT "respondents".* FROM "respondents" WHERE "respondents"."id" = 1 LIMIT 1
---
  def results
    @name = session[:survey_name]
    @description = session[:survey_description]
    @respondent = Respondent.find_by_id(session[:ID])